03. CLIENTE DE CONSOLA/CLIENTE_CONSOLA/CLIENTE_CONSOLA/OpenAPIs/CreditoService.json

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.4.3.payara-p6 (FISH-5811-df8dba8; 2021-12-02T15:42:59+0000) JAXWS-RI/2.3.2.payara-p4 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is Metro/2.4.3.payara-p6 (FISH-5811-df8dba8; 2021-12-02T15:42:59+0000) JAXWS-RI/2.3.2.payara-p4 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.monster.edu.ec/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.monster.edu.ec/" name="CreditoService">
<types>
<xsd:schema>
<xsd:import namespace="http://ws.monster.edu.ec/" schemaLocation="http://localhost:8080/Examen_Practico_Primer_Parcial/CreditoService?xsd=1"/>
</xsd:schema>
</types>
<message name="otorgarCreditoYCrearAmortizacion">
<part name="parameters" element="tns:otorgarCreditoYCrearAmortizacion"/>
</message>
<message name="otorgarCreditoYCrearAmortizacionResponse">
<part name="parameters" element="tns:otorgarCreditoYCrearAmortizacionResponse"/>
</message>
<message name="verificarSujetoCredito">
<part name="parameters" element="tns:verificarSujetoCredito"/>
</message>
<message name="verificarSujetoCreditoResponse">
<part name="parameters" element="tns:verificarSujetoCreditoResponse"/>
</message>
<message name="calcularMontoMaximoCredito">
<part name="parameters" element="tns:calcularMontoMaximoCredito"/>
</message>
<message name="calcularMontoMaximoCreditoResponse">
<part name="parameters" element="tns:calcularMontoMaximoCreditoResponse"/>
</message>
<message name="obtenerAmortizacionPorCredito">
<part name="parameters" element="tns:obtenerAmortizacionPorCredito"/>
</message>
<message name="obtenerAmortizacionPorCreditoResponse">
<part name="parameters" element="tns:obtenerAmortizacionPorCreditoResponse"/>
</message>
<message name="obtenerCodigoCliente">
<part name="parameters" element="tns:obtenerCodigoCliente"/>
</message>
<message name="obtenerCodigoClienteResponse">
<part name="parameters" element="tns:obtenerCodigoClienteResponse"/>
</message>
<message name="obtenerCodigoCredito">
<part name="parameters" element="tns:obtenerCodigoCredito"/>
</message>
<message name="obtenerCodigoCreditoResponse">
<part name="parameters" element="tns:obtenerCodigoCreditoResponse"/>
</message>
<portType name="CreditoService">
<operation name="otorgarCreditoYCrearAmortizacion">
<input wsam:Action="http://ws.monster.edu.ec/CreditoService/otorgarCreditoYCrearAmortizacionRequest" message="tns:otorgarCreditoYCrearAmortizacion"/>
<output wsam:Action="http://ws.monster.edu.ec/CreditoService/otorgarCreditoYCrearAmortizacionResponse" message="tns:otorgarCreditoYCrearAmortizacionResponse"/>
</operation>
<operation name="verificarSujetoCredito">
<input wsam:Action="http://ws.monster.edu.ec/CreditoService/verificarSujetoCreditoRequest" message="tns:verificarSujetoCredito"/>
<output wsam:Action="http://ws.monster.edu.ec/CreditoService/verificarSujetoCreditoResponse" message="tns:verificarSujetoCreditoResponse"/>
</operation>
<operation name="calcularMontoMaximoCredito">
<input wsam:Action="http://ws.monster.edu.ec/CreditoService/calcularMontoMaximoCreditoRequest" message="tns:calcularMontoMaximoCredito"/>
<output wsam:Action="http://ws.monster.edu.ec/CreditoService/calcularMontoMaximoCreditoResponse" message="tns:calcularMontoMaximoCreditoResponse"/>
</operation>
<operation name="obtenerAmortizacionPorCredito">
<input wsam:Action="http://ws.monster.edu.ec/CreditoService/obtenerAmortizacionPorCreditoRequest" message="tns:obtenerAmortizacionPorCredito"/>
<output wsam:Action="http://ws.monster.edu.ec/CreditoService/obtenerAmortizacionPorCreditoResponse" message="tns:obtenerAmortizacionPorCreditoResponse"/>
</operation>
<operation name="obtenerCodigoCliente">
<input wsam:Action="http://ws.monster.edu.ec/CreditoService/obtenerCodigoClienteRequest" message="tns:obtenerCodigoCliente"/>
<output wsam:Action="http://ws.monster.edu.ec/CreditoService/obtenerCodigoClienteResponse" message="tns:obtenerCodigoClienteResponse"/>
</operation>
<operation name="obtenerCodigoCredito">
<input wsam:Action="http://ws.monster.edu.ec/CreditoService/obtenerCodigoCreditoRequest" message="tns:obtenerCodigoCredito"/>
<output wsam:Action="http://ws.monster.edu.ec/CreditoService/obtenerCodigoCreditoResponse" message="tns:obtenerCodigoCreditoResponse"/>
</operation>
</portType>
<binding name="CreditoServicePortBinding" type="tns:CreditoService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="otorgarCreditoYCrearAmortizacion">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="verificarSujetoCredito">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="calcularMontoMaximoCredito">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="obtenerAmortizacionPorCredito">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="obtenerCodigoCliente">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="obtenerCodigoCredito">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="CreditoService">
<port name="CreditoServicePort" binding="tns:CreditoServicePortBinding">
<soap:address location="http://localhost:8080/Examen_Practico_Primer_Parcial/CreditoService"/>
</port>
</service>
</definitions>